uhnp/src/InformationRegisters/ДатыСозданийМероприятий/ДатыСозданийМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыСозданийМероприятий</name>
  <resources>
    <name>ДатаПоследнегоИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСледующегоИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ШаблонМероприятия</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Риск</name>
    <type>
      <types>CatalogRef.Риски</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиИспользованияШаблоновМероприятий/НастройкиИспользованияШаблоновМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИспользованияШаблоновМероприятий</name>
  <resources>
    <name>НазначенОсновным</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>РасписаниеПовторения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.Риски</types>
      <types>EnumRef.СпособыВыбораПоставщика</types>
      <types>CatalogRef.Цели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонМероприятия</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыМероприятий/ВидыМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМероприятий</name>
  <enumValues>
    <name>КонтрольноеМероприятие</name>
  </enumValues>
  <enumValues>
    <name>Инициатива</name>
  </enumValues>
  <enumValues>
    <name>РеакцияНаРиск</name>
  </enumValues>
  <enumValues>
    <name>ЗакупочнаяПроцедура</name>
  </enumValues>
  <enumValues>
    <name>ОценкаПоставщиков</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/Мероприятие/Мероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Мероприятие</name>
  <basedOn>Document.РисковоеСобытие</basedOn>
  <basedOn>Catalog.Риски</basedOn>
  <basedOn>Catalog.Цели</basedOn>
  <basedOn>Catalog.ЗакупочныеПроцедуры</basedOn>
  <registerRecords>InformationRegister.КонтекстыМероприятий</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаЛиквидациюРисков</registerRecords>
  <registerRecords>InformationRegister.ПрогрессСтадийМероприятий</registerRecords>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.Риски</types>
      <types>DocumentRef.РисковоеСобытие</types>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
      <types>CatalogRef.Цели</types>
      <types>DocumentRef.КритерииОценкиПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРеакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическиеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеакцииНаРисковоеСобытие</name>
    <type>
      <types>CatalogRef.ТипРеакцииНаРисковоеСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОРезультатах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Предписания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительПредписания</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьИсполненияПредписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийПрогресс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонМероприятия</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыбораПоставщика</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОфициальногоОбъявленияЗакупки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.СостоянияВыполненияКонтрольныхПроцедур</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Стадии</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.СтадииМероприятий</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРеакции</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановыеЗатратыСтадии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиеЗатратыСтадии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прогресс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапомнитьОСтадии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйСтадии</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>РезюмеСтадии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтогВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаРодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующаяСтрока</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеГруппы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВложения</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзШаблона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтекстыМероприятий</name>
    <attributes>
      <name>Контекст</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИтоговыеДокументы</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйДокумент</name>
      <type>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипИтоговогоДокумента</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаФайл</name>
      <type>
        <types>CatalogRef.МероприятиеПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/CommonModules/УправлениеРисками/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль Реализует логику работы подсистемы УправлениеРисками в контексте 
// серверного кода.
////////////////////////////////////////////////////////////////////////////////

// Записывает в регистр ДатыСозданийМероприятий шаблон мероприятия ШаблонМероприятияВход,
// дату последнего исполнения ДатаПоследнегоИсполненияВход, дату следующего
// исполнения ДатаСледующегоИсполненияВход.
Процедура УстановитьДатуСозданияМероприятияПоРасписанию(ШаблонМероприятияВход, РискВход, ДатаПоследнегоИсполненияВход, ДатаСледующегоИсполненияВход) Экспорт 
	Попытка
		МенеджерЗаписи = РегистрыСведений.ДатыСозданийМероприятий.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Риск						 = РискВход;
		МенеджерЗаписи.ШаблонМероприятия		 = ШаблонМероприятияВход;
		МенеджерЗаписи.ДатаПоследнегоИсполнения	 = ДатаПоследнегоИсполненияВход;
		МенеджерЗаписи.ДатаСледующегоИсполнения	 = ДатаСледующегоИсполненияВход;
		МенеджерЗаписи.Записать();
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось установить дату создания мероприятия по шаблону %Шаблон%: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Шаблон%", Строка(ШаблонМероприятияВход));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры			// УстановитьДатуСозданияМероприятияПоРасписанию()

// Записывает в регистр ДатыСозданийМероприятий даты последнего и 
// следующего выполняения создания мероприятий по расписанию РасписаниеВход
// шаблона мероприятий ШаблонМероприятияВход. В качестве последнего 
// значения будет установлена ДатаВход, когда параметр не задан - 
// текущая дата. Дата следующего выполнения будет вычислена на 
// основе даты последнего и настройки расписания этапа.
Процедура УстановитьТекущуюДатуОбработкиМероприятия(ШаблонМероприятияВход, РискВход, РасписаниеВход, ДатаВход = Неопределено) Экспорт
	Если ДатаВход = Неопределено Тогда
		ДатаРабочая = ТекущаяДата();
	Иначе
		ДатаРабочая = ДатаВход;
	КонецЕсли;
	Если ТипЗнч(РасписаниеВход) = Тип("РасписаниеРегламентногоЗадания") Тогда
		НоваяДата = ПолучитьЗапланированныйМоментЗапускаЗадания(РасписаниеВход, "", ДатаРабочая, ДатаРабочая + 1);
		УстановитьДатуСозданияМероприятияПоРасписанию(ШаблонМероприятияВход, РискВход, ДатаРабочая, НоваяДата);
	Иначе
		// Не удалось получить расписание. Пропускаем.
	КонецЕсли;
КонецПроцедуры		// УстановитьТекущуюДатуОбработкиМероприятия()

// Выполняет создание мероприятий из шаблонов по расписанию.
Процедура СоздатьМероприятияПоРасписанию() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыСозданийМероприятий.ШаблонМероприятия КАК ШаблонМероприятия,
		|	ДатыСозданийМероприятий.ДатаПоследнегоИсполнения КАК ДатаПоследнегоИсполнения,
		|	ДатыСозданийМероприятий.ДатаСледующегоИсполнения КАК ДатаСледующегоИсполнения,
		|	ДатыСозданийМероприятий.Риск КАК Риск,
		|	ЕСТЬNULL(НастройкиИспользованияШаблоновМероприятий.РасписаниеПовторения, НЕОПРЕДЕЛЕНО) КАК РасписаниеПовторения,
		|	ДатыСозданийМероприятий.Риск.Организация КАК Организация,
		|	ДатыСозданийМероприятий.Риск.ЦФО КАК ЦФО,
		|	ДатыСозданийМероприятий.Риск.Проект КАК Проект
		|ИЗ
		|	РегистрСведений.ДатыСозданийМероприятий КАК ДатыСозданийМероприятий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиИспользованияШаблоновМероприятий КАК НастройкиИспользованияШаблоновМероприятий
		|		ПО ДатыСозданийМероприятий.Риск = НастройкиИспользованияШаблоновМероприятий.Контекст
		|			И ДатыСозданийМероприятий.ШаблонМероприятия = НастройкиИспользованияШаблоновМероприятий.ШаблонМероприятия
		|			И (НастройкиИспользованияШаблоновМероприятий.ИспользоватьРасписание)
		|			И (НастройкиИспользованияШаблоновМероприятий.ВидМероприятия = ЗНАЧЕНИЕ(Перечисление.ВидыМероприятий.КонтрольноеМероприятие))
		|ГДЕ
		|	ДатыСозданийМероприятий.ДатаСледующегоИсполнения <= &ТекущаяДата
		|	И ДатыСозданийМероприятий.ДатаСледующегоИсполнения <> &ПустаяДата";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекШаблон		 = ВыборкаДетальныеЗаписи.ШаблонМероприятия;
		ТекРиск			 = ВыборкаДетальныеЗаписи.Риск;
		ТекРасписание	 = ВыборкаДетальныеЗаписи.РасписаниеПовторения;
		Если ЗначениеЗаполнено(ТекШаблон) Тогда
			Попытка
				// Создание документа.
				НовоеНаименование = НСтр("ru = 'Контрольное мероприятие по риску %Риск% (создано автоматически)'");
				НовоеНаименование = СтрЗаменить(НовоеНаименование, "%Риск%", Строка(ТекРиск));
				НовоеМероприятие = Документы.Мероприятие.СоздатьДокумент();
				НовоеМероприятие.Заполнить(ТекШаблон);
				НовоеМероприятие.НаименованиеРеакции	 = НовоеНаименование;
				НовоеМероприятие.Дата					 = ТекущаяДатаСеанса();
				НовоеМероприятие.Контекст				 = ТекРиск;
				НовоеМероприятие.Организация			 = ВыборкаДетальныеЗаписи.Организация;
				НовоеМероприятие.ЦФО					 = ВыборкаДетальныеЗаписи.ЦФО;
				НовоеМероприятие.Проект					 = ВыборкаДетальныеЗаписи.Проект;
				НовоеМероприятие.Записать();
				// Обновление даты следующегно создания.
				РасписаниеРабочее = Новый РасписаниеРегламентногоЗадания;
				Если ТекРасписание <> Неопределено Тогда
					РасписаниеРабочее = ТекРасписание.Получить();
				Иначе
					РасписаниеРабочее = Новый РасписаниеРегламентногоЗадания;
				КонецЕсли;
				УстановитьТекущуюДатуОбработкиМероприятия(ТекШаблон, ТекРиск, РасписаниеРабочее);
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось создать мероприятие по шаблону %Шаблон%: %ОписаниеОшибки%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Шаблон%", Строка(ТекШаблон));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
		Иначе
			// Шаблон пустой. Пропускаем.
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры		// СоздатьМероприятияПоРасписанию()



// Возвращает структуру полей расшифровки по отчету Диаграмма рисков.
Функция ПолучитьПоляРасшифровкиДиаграммаРисков(АдресРасшифровки, Расшифровка, СтандартнаяОбработка) Экспорт
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Вероятность", Справочники.СтепениРиска.ПустаяСсылка());
	РезультатФункции.Вставить("Ущерб", Справочники.КатегорииУщерба.ПустаяСсылка());
	Если ЭтоАдресВременногоХранилища(АдресРасшифровки) Тогда
		ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресРасшифровки);
		ЭлементыРасшифровки = ДанныеРасшифровки.Элементы;
		ТекЭлементы = ЭлементыРасшифровки[Расшифровка];
		РодителиЭлементов = ТекЭлементы.ПолучитьРодителей();
		Для Каждого ТекРодителиЭлементов Из РодителиЭлементов Цикл
			ПоляРодителей = ТекРодителиЭлементов.ПолучитьПоля();
			Для Каждого ТекПоляРодителей Из ПоляРодителей Цикл
				Если СокрЛП(ТекПоляРодителей.Поле) = "Вероятность" Тогда
					РезультатФункции.Вставить("Вероятность", ТекПоляРодителей.Значение);
				ИначеЕсли СокрЛП(ТекПоляРодителей.Поле) = "Ущерб" Тогда
					РезультатФункции.Вставить("Ущерб", ТекПоляРодителей.Значение);
				Иначе
					// Выполняем поиск далее.
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;	
	Иначе
		// Не адрес компоновки. Оставляем поле пустым.
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьПоляРасшифровкиДиаграммаРисков()

#Область Кнопка_ЗапросНалоговогоМониторинга

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд.
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	//Вид = ВидыПодключаемыхКоманд.Добавить();
	//Вид.Имя = "ВводМероприятия";
	//Вид.ИмяПодменю = "ПодменюСоздатьНаОсновании";
	//Вид.Заголовок = НСтр("ru = 'Создать на основании'");
	//Вид.Картинка = БиблиотекаКартинок.ВводНаОсновании;
	//Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;
	//Вид.ВидГруппыФормы = ВидГруппыФормы.Подменю;
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт

	//Если Пользователи.ЭтоПолноправныйПользователь(, Истина) Тогда
	//    Возврат;
	//ИначеЕсли Не Пользователи.РолиДоступны("ВводМероприятийНаОсновании") Тогда
	//	Возврат;
	Если Не НастройкиФормы.Свойство("ИмяФормы") Тогда 
		Возврат;
	ИначеЕсли Не СтрНачинаетсяС(НастройкиФормы.ИмяФормы, "Документ.") 
		И Не СтрНачинаетсяС(НастройкиФормы.ИмяФормы, "Справочник.") Тогда
		Возврат;
	КонецЕсли;
	
	ТипыОбъектов = Новый Массив;
	Для каждого СтрокаИсточник Из Источники.Строки Цикл
		Если ЗначениеЗаполнено(СтрокаИсточник.ПолноеИмя) Тогда
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрокаИсточник.ПолноеИмя);
			ТипыОбъектов.Добавить(ТипЗнч(Менеджер.ПустаяСсылка()));				
		КонецЕсли;		
	КонецЦикла;
		
	ТипПараметра = Новый ОписаниеТипов(ТипыОбъектов);
	
	Команда = Команды.Добавить();
	Команда.Вид = "СозданиеНаОсновании";
	Команда.Идентификатор = "ВводМероприятия";
	Команда.Представление = НСтр("ru = 'Добавить мероприятие СВК'");
	Команда.Важность = "Обычное";
	Команда.Порядок = 10;
	Команда.ОтображениеКнопки = ОтображениеКнопки.КартинкаИТекст;
	Команда.Картинка = БиблиотекаКартинок.ПодсистемаУправлениеРисками;
	Команда.ТипПараметра = ТипПараметра;
	Команда.Назначение = "ДляОбъекта";
	//Команда.ФункциональныеОпции = "";
	Команда.ИзменяетВыбранныеОбъекты = Ложь;
	Команда.МножественныйВыбор = Ложь;
	Команда.РежимЗаписи = "Записывать";
	Команда.Обработчик = "УправлениеРискамиКлиент.ВводМероприятий_Подключаемый";	

КонецПроцедуры

#КонецОбласти


// Рассчитывает следующий момент запуска задания.
//
// Параметры:
// Расписание                  - РасписаниеРегламентногоЗадания - расписание,
//                               для которого требуется рассчитать момент следующего запуска.
// ЧасовойПояс				   - Строка - часовой пояс.
// ДатаНачалаПоследнегоЗапуска - Дата - Дата начала последнего запуска регламентного задания.
//                               Если дата задана, то используется для проверки таких условий как.
//                               ПериодПовтораДней, ПериодНедель, ПериодПовтораВТечениеДня.
//                               Если дата не задана, то считается,
//                               что задание не выполнялось ни разу и проверка этих условий не производится.
//
// Возвращаемое значение:
//   Дата - рассчитанный следующий момент запуска задания.
//
Функция ПолучитьЗапланированныйМоментЗапускаЗадания(Знач Расписание, Знач ЧасовойПояс, 
		Знач ДатаНачалаПоследнегоЗапуска = '00010101', Знач ДатаЗавершенияПоследнегоЗапуска = '00010101') Экспорт
	
	Если ПустаяСтрока(ЧасовойПояс) Тогда
		ЧасовойПояс = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачалаПоследнегоЗапуска) Тогда 
		ДатаНачалаПоследнегоЗапуска = МестноеВремя(ДатаНачалаПоследнегоЗапуска, ЧасовойПояс);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаЗавершенияПоследнегоЗапуска) Тогда
		ДатаЗавершенияПоследнегоЗапуска = МестноеВремя(ДатаЗавершенияПоследнегоЗапуска, ЧасовойПояс);
	КонецЕсли;
	
	ДатаРасчета = МестноеВремя(ТекущаяУниверсальнаяДата(), ЧасовойПояс);
	
	НайденнаяДата = СледующаяДатаВыполненияРасписания(Расписание, ДатаРасчета, ДатаНачалаПоследнегоЗапуска, ДатаЗавершенияПоследнегоЗапуска);
	
	Если ЗначениеЗаполнено(НайденнаяДата) Тогда
		Возврат УниверсальноеВремя(НайденнаяДата, ЧасовойПояс);
	Иначе
		Возврат НайденнаяДата;
	КонецЕсли;
	
КонецФункции

// Возвращает следующую дата выполнения расписания.
//
// Параметры:
//  Расписание - РасписаниеРегламентногоЗадания - расписание по которому
//   будет рассчитываться дата.
//  ДатаДляПроверки - Дата - минимальная дата на которую может
//   быть запланировано выполнение.
//  ДатаНачалаПоследнегоЗапуска - Дата - Дата начала последнего 
//   запуска задания. Если дата задана, то используется для проверки таких 
//   условий как ПериодПовтораДней, ПериодНедель, ПериодПовтораВТечениеДня. 
//   Если дата не задана, то считается, что задание не выполнялось ни разу 
//   и проверка этих условий не производится. 
//  ДатаЗавершенияПоследнегоЗапуска - Дата - Дата завершения 
//   последнего запуска задания. Если дата задана, то используется для 
//   проверки условия ПаузаПовтора. Если дата не задана, то считается, что 
//   задание ни разу не завершалось, и проверка этого условия не производится. 
//  МаксимальныйГоризонтПланирования - Число - Максимальное количество секунд
//   относительно ДатаДляПроверки на которое может быть выполнено планирование.
//   Увеличение значения может привести к замедлению расчета на сложных
//   расписаниях.
//
// Возвращаемое значение: 
//  Дата - следующая дата выполнения расписания.
//
Функция СледующаяДатаВыполненияРасписания(Знач Расписание, Знач ДатаДляПроверки, 
	Знач ДатаНачалаПоследнегоЗапуска = Неопределено, Знач ДатаЗавершенияПоследнегоЗапуска = Неопределено, 
	Знач МаксимальныйГоризонтПланирования = Неопределено)
	
	Если МаксимальныйГоризонтПланирования = Неопределено Тогда
		МаксимальныйГоризонтПланирования = 366 * 86400 * 10;
	КонецЕсли;
	
	ИсходнаяДатаДляПроверки = ДатаДляПроверки;
	ВремяНачалаПоследнегоЗапуска = '00010101' + (ДатаНачалаПоследнегоЗапуска - НачалоДня(ДатаНачалаПоследнегоЗапуска));
	
	// Границы по датам
	Если ЗначениеЗаполнено(Расписание.ДатаКонца)
		И ДатаДляПроверки > Расписание.ДатаКонца Тогда
		
		// Интервал выполнения по дням закончился.
		Возврат '00010101';
	КонецЕсли;
		
	Если ДатаДляПроверки < Расписание.ДатаНачала Тогда
		ДатаДляПроверки = Расписание.ДатаНачала;
	КонецЕсли;
	
	МожноМенятьДень = Истина;
	
	// Учет периодичности
	Если ЗначениеЗаполнено(ДатаНачалаПоследнегоЗапуска) Тогда
		
		// Период недель
		Если Расписание.ПериодНедель > 1
			И (НачалоНедели(ДатаДляПроверки) - НачалоНедели(ДатаНачалаПоследнегоЗапуска)) / (7 * 86400) < Расписание.ПериодНедель Тогда
		
			ДатаДляПроверки = НачалоНедели(ДатаНачалаПоследнегоЗапуска) + 7 * 86400 * Расписание.ПериодНедель;
		КонецЕсли;
		
		// Период дней
		Если Расписание.ПериодПовтораДней = 0 Тогда
			Если НачалоДня(ДатаДляПроверки) <> НачалоДня(ДатаНачалаПоследнегоЗапуска) Тогда
				// Повторения не установлено и задание уже выполнялось.
				Возврат '00010101';
			КонецЕсли;
			
			МожноМенятьДень = Ложь;
		КонецЕсли;
		
		Если Расписание.ПериодПовтораДней > 1
			И НачалоДня(ДатаДляПроверки) - НачалоДня(ДатаНачалаПоследнегоЗапуска) < (Расписание.ПериодПовтораДней - 1)* 86400 Тогда
			
			ДатаДляПроверки = НачалоДня(ДатаНачалаПоследнегоЗапуска) + Расписание.ПериодПовтораДней * 86400;
		КонецЕсли;
		
		// Если задание повторяется раз в день (но не чаще) то сдвигаем на следующий день после последнего запуска.
		Если Расписание.ПериодПовтораДней = 1 И Расписание.ПериодПовтораВТечениеДня = 0 Тогда
			ДатаДляПроверки = Макс(ДатаДляПроверки, НачалоДня(ДатаНачалаПоследнегоЗапуска+86400));
		КонецЕсли;

	КонецЕсли;
	
	// Учет допустимых интервалов запуска.
	ПоменятьМесяц = Ложь;
	ПоменятьДень = Ложь;
	Пока Истина Цикл
		
		Если ДатаДляПроверки - ИсходнаяДатаДляПроверки > МаксимальныйГоризонтПланирования Тогда
			// Отложить планирование
			Возврат '00010101';
		КонецЕсли;
		
		Если НЕ МожноМенятьДень
			И (ПоменятьДень ИЛИ ПоменятьМесяц) Тогда
			
			// Повторения не установлено и задание уже выполнялось.
			Возврат '00010101';
		КонецЕсли;
		
		// Месяцы
		Пока ПоменятьМесяц
			ИЛИ Расписание.Месяцы.Количество() > 0 
			И Расписание.Месяцы.Найти(Месяц(ДатаДляПроверки)) = Неопределено Цикл
			
			ПоменятьМесяц = Ложь;
			
			// Переход на следующий месяц
			ДатаДляПроверки = НачалоМесяца(ДобавитьМесяц(ДатаДляПроверки, 1));
		КонецЦикла;
		
		// День месяца
		ДнейВМесяце = День(КонецМесяца(ДатаДляПроверки));
		Если Расписание.ДеньВМесяце <> 0 Тогда
			
			ТекущийДень = День(ДатаДляПроверки);
			
			Если Расписание.ДеньВМесяце > 0 
				И (ДнейВМесяце < Расписание.ДеньВМесяце ИЛИ ТекущийДень > Расписание.ДеньВМесяце)
				ИЛИ Расписание.ДеньВМесяце < 0 
				И (ДнейВМесяце < -Расписание.ДеньВМесяце ИЛИ ТекущийДень > ДнейВМесяце - -Расписание.ДеньВМесяце) Тогда
				
				// В этом месяце нет такого числа или оно уже прошло.
				ПоменятьМесяц = Истина;
				Продолжить;
			КонецЕсли;
			
			Если Расписание.ДеньВМесяце > 0 Тогда
				ДатаДляПроверки = НачалоМесяца(ДатаДляПроверки) + (Расписание.ДеньВМесяце - 1) * 86400;
			КонецЕсли;
			
			Если Расписание.ДеньВМесяце < 0 Тогда
				ДатаДляПроверки = НачалоДня(КонецМесяца(ДатаДляПроверки)) - (-Расписание.ДеньВМесяце -1) * 86400;
			КонецЕсли;
		КонецЕсли;
		
		// День недели в месяце
		Если Расписание.ДеньНеделиВМесяце <> 0 Тогда
			Если Расписание.ДеньНеделиВМесяце > 0 Тогда
				ДеньНачалаНедели = (Расписание.ДеньНеделиВМесяце - 1) * 7 + 1;
			КонецЕсли;
			Если Расписание.ДеньНеделиВМесяце < 0 Тогда
				ДеньНачалаНедели = ДнейВМесяце - (-Расписание.ДеньНеделиВМесяце) * 7 + 1;
			КонецЕсли;
			
			ДеньКонцаНедели = Мин(ДеньНачалаНедели + 6, ДнейВМесяце);
			
			Если День(ДатаДляПроверки) > ДеньКонцаНедели 
				ИЛИ ДеньНачалаНедели > ДнейВМесяце Тогда
				// В этом месяце нужная неделя уже прошла (или ее не было).
				ПоменятьМесяц = Истина;
				Продолжить;
			КонецЕсли;
			
			Если День(ДатаДляПроверки) < ДеньНачалаНедели Тогда
				Если Расписание.ДеньВМесяце <> 0 Тогда
					
					// День зафиксирован и он не подходит.
					ПоменятьМесяц = Истина;
					Продолжить;
				КонецЕсли;
				ДатаДляПроверки = НачалоМесяца(ДатаДляПроверки) + (ДеньНачалаНедели - 1) * 86400;
			КонецЕсли;
		КонецЕсли;
		
		// День недели
		Пока ПоменятьДень
			ИЛИ Расписание.ДниНедели.Найти(ДеньНедели(ДатаДляПроверки)) = Неопределено
			И Расписание.ДниНедели.Количество() > 0 Цикл
			
			ПоменятьДень = Ложь;
			
			Если Расписание.ДеньВМесяце <> 0 Тогда
				// День зафиксирован и он не подходит.
				ПоменятьМесяц = Истина;
				Прервать;
			КонецЕсли;
			
			Если День(ДатаДляПроверки) = ДнейВМесяце Тогда
				// Месяц кончился
				ПоменятьМесяц = Истина;
				Прервать;
			КонецЕсли;
			
			Если Расписание.ДеньНеделиВМесяце <> 0
				И День(ДатаДляПроверки) = ДеньКонцаНедели Тогда
				
				// Нужная неделя кончилась
				ПоменятьМесяц = Истина;
				Прервать;
			КонецЕсли;
			
			ДатаДляПроверки = НачалоДня(ДатаДляПроверки) + 86400;
		КонецЦикла;
		Если ПоменятьМесяц Тогда
			Продолжить;
		КонецЕсли;
		
		// Учет времени
		ВремяДляПроверки = '00010101' + (ДатаДляПроверки - НачалоДня(ДатаДляПроверки));
		
		Если Расписание.ДетальныеРасписанияДня.Количество() = 0 Тогда
			ДетальныеРасписания = Новый Массив;
			ДетальныеРасписания.Добавить(Расписание);


		Иначе
			ДетальныеРасписания = Расписание.ДетальныеРасписанияДня;


		КонецЕсли;
		
		// Если у нас есть промежутки, с переходом через полночь, то разбиваем их на два промежутка.
		Индекс = 0;
		Пока Индекс < ДетальныеРасписания.Количество() Цикл
			
			РасписаниеДня = ДетальныеРасписания[Индекс];
			
			Если НЕ ЗначениеЗаполнено(РасписаниеДня.ВремяНачала) ИЛИ НЕ ЗначениеЗаполнено(РасписаниеДня.ВремяКонца) Тогда
				Индекс = Индекс + 1;
				Продолжить;
			КонецЕсли;
			
			Если РасписаниеДня.ВремяНачала > РасписаниеДня.ВремяКонца Тогда
				
				РасписаниеДняПерваяПоловина = Новый РасписаниеРегламентногоЗадания();
				ЗаполнитьЗначенияСвойств(РасписаниеДняПерваяПоловина,РасписаниеДня);
				РасписаниеДняПерваяПоловина.ВремяНачала = НачалоДня(РасписаниеДняПерваяПоловина.ВремяНачала);
				ДетальныеРасписания.Добавить(РасписаниеДняПерваяПоловина);
				
				РасписаниеДняВтораяПоловина = Новый РасписаниеРегламентногоЗадания();
				ЗаполнитьЗначенияСвойств(РасписаниеДняВтораяПоловина,РасписаниеДня);
				РасписаниеДняВтораяПоловина.ВремяКонца = КонецДня(РасписаниеДняВтораяПоловина.ВремяНачала);
				ДетальныеРасписания.Добавить(РасписаниеДняВтораяПоловина);
				
				ДетальныеРасписания.Удалить(Индекс);
				
			Иначе
				
				Индекс = Индекс + 1;
				
			КонецЕсли;
		
		КонецЦикла;
		
		Для Индекс = 0 По ДетальныеРасписания.ВГраница() Цикл
			РасписаниеДня = ДетальныеРасписания[Индекс];
			
			// Границы по времени
			Если ЗначениеЗаполнено(РасписаниеДня.ВремяНачала)
				И ВремяДляПроверки < РасписаниеДня.ВремяНачала Тогда
				
				ВремяДляПроверки = РасписаниеДня.ВремяНачала;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РасписаниеДня.ВремяКонца)
				И ВремяДляПроверки > РасписаниеДня.ВремяКонца Тогда
				
				Если Индекс < ДетальныеРасписания.ВГраница() Тогда
					// Есть еще расписания дня
					Продолжить;
				КонецЕсли;
				
				// В этом дне подходящее время уже прошло.
				ПоменятьДень = Истина;
				Прервать;
			КонецЕсли;
			
			// Период повтора в течении дня.
			Если ЗначениеЗаполнено(ДатаНачалаПоследнегоЗапуска) Тогда
				
				Если РасписаниеДня.ПериодПовтораВТечениеДня = 0
					И НачалоДня(ДатаДляПроверки) = НачалоДня(ДатаНачалаПоследнегоЗапуска)
					И (НЕ ЗначениеЗаполнено(РасписаниеДня.ВремяНачала) 
						ИЛИ ЗначениеЗаполнено(РасписаниеДня.ВремяНачала) И ВремяНачалаПоследнегоЗапуска >= РасписаниеДня.ВремяНачала)
					И (НЕ ЗначениеЗаполнено(РасписаниеДня.ВремяКонца) 
						ИЛИ ЗначениеЗаполнено(РасписаниеДня.ВремяКонца) И ВремяНачалаПоследнегоЗапуска <= РасписаниеДня.ВремяКонца) Тогда
					
					// В этом интервале (расписании дня) задание уже выполнялось и повторы не установлены.
					Если Индекс < ДетальныеРасписания.ВГраница() Тогда
						Продолжить;
					КонецЕсли;
					
					ПоменятьДень = Истина;
					Прервать;
				КонецЕсли;
				
				Если НачалоДня(ДатаДляПроверки) = НачалоДня(ДатаНачалаПоследнегоЗапуска)
					И ВремяДляПроверки - ВремяНачалаПоследнегоЗапуска < РасписаниеДня.ПериодПовтораВТечениеДня Тогда
					
					НовоеВремяДляПроверки = ВремяНачалаПоследнегоЗапуска + РасписаниеДня.ПериодПовтораВТечениеДня;
					
					Если ЗначениеЗаполнено(РасписаниеДня.ВремяКонца) И НовоеВремяДляПроверки > РасписаниеДня.ВремяКонца
						ИЛИ НачалоДня(НовоеВремяДляПроверки) <> НачалоДня(ВремяДляПроверки) Тогда
						
						// Время ушло за интервал
						Если Индекс < ДетальныеРасписания.ВГраница() Тогда
							Продолжить;
						КонецЕсли;
						
						ПоменятьДень = Истина;
						Прервать;
					КонецЕсли;
					
					ВремяДляПроверки = НовоеВремяДляПроверки;
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Пауза
			Если ЗначениеЗаполнено(ДатаЗавершенияПоследнегоЗапуска) 
				И ЗначениеЗаполнено(РасписаниеДня.ПаузаПовтора) Тогда
				
				ВремяЗавершенияПоследнегоЗапуска = '00010101' + (ДатаЗавершенияПоследнегоЗапуска - НачалоДня(ДатаЗавершенияПоследнегоЗапуска));
				
				Если НачалоДня(ДатаДляПроверки) = НачалоДня(ДатаНачалаПоследнегоЗапуска)
					И ВремяДляПроверки - ВремяЗавершенияПоследнегоЗапуска < РасписаниеДня.ПаузаПовтора Тогда
					
					НовоеВремяДляПроверки = ВремяЗавершенияПоследнегоЗапуска + РасписаниеДня.ПаузаПовтора;
					
					Если ЗначениеЗаполнено(РасписаниеДня.ВремяКонца) И НовоеВремяДляПроверки > РасписаниеДня.ВремяКонца
						ИЛИ НачалоДня(НовоеВремяДляПроверки) <> НачалоДня(ВремяДляПроверки) Тогда
						
						// Время ушло за интервал
						Если Индекс < ДетальныеРасписания.ВГраница() Тогда
							Продолжить;
						КонецЕсли;
						
						ПоменятьДень = Истина;
						Прервать;
					КонецЕсли;
					
					ВремяДляПроверки = НовоеВремяДляПроверки;
					
				КонецЕсли;
			КонецЕсли;
			
			// Нашли подходящее время
			Прервать;
			
		КонецЦикла;
		
		Если ПоменятьДень Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Расписание.ВремяЗавершения)
			И ВремяДляПроверки > Расписание.ВремяЗавершения Тогда
			// В этом дне выполнять поздно.
			ПоменятьДень = Истина;
			Продолжить;
		КонецЕсли;
		
		ДатаДляПроверки = НачалоДня(ДатаДляПроверки) + (ВремяДляПроверки - НачалоДня(ВремяДляПроверки));
		
		Возврат ДатаДляПроверки;
		
	КонецЦикла;
	
КонецФункции
